{
    "summary_The Stories we Weave.txt": "Our initial reaction is unconscious and valid. We then have the opportunity to evolve our consciousness by choosing to rewrite our story. It isn't about what someone else has done to us or that they are trying to hurt us, it is just an event. It is our choice to come from a conscious choosing of our response or adding to our story and letting our unconscious reaction hold us prisoner.",
    "summary_Pain a Divine Purpose.txt": "In the midst of my suffering, I do feel powerless, separate and victimized (aka abandoned), which only adds to my mental, emotional, physical and spiritual dis”ease. So I wonder if not everything and everyone in our life is our Divine Purpose. Not to change or fix, but to let us see what our choices are, so, we may make new choices from a different perspective.",
    "summary_What would you do… if you Loved yourself.txt": "Once I asked myself – and healed some of the reasons I was making poor eating choices for example – ‘if I loved myself, what would I do’, I had other areas come up such as pain that was blocking me from being able to move freely! I realized this ‘pain’ was just another result of where I was sabotaging myself and others to feel safe and supported within. Because the outside world can’t make me feel safe or supported it is my wounded inner child that is manipulating everything outside to show me my inner beliefs and needs! Everything is in our life for a reason. Everything is  in our lives for a purpose.",
    "summary_Consciousness of Sabotaging Change.txt": "Most of us believe that we are in control – when the fact is that we can't control anything. If we accept our current reality this doesn't mean we Love it – it means we are aware of where we are and maybe even the fears that we have. Then Life will be about what choices we make – not from a fear place but from an awareness and acceptance place.",
    "summary_Shifting Victim Consciousness.txt": "Prior to the age of 7 we didn't have a say in how we chose our life. We created a trigger around family and believed we were a victim. If we accept we are a victim then we are letting our fears control and manipulate us. It is always easier to blame others or society. I choose to takeresponsibility for my life and make choices that empower me to Grow Up.",
    "summary_Practices for Receiving the Gentle Guidance of the Soul.txt": "How well we understand ourselves and how we learn, will assist us in understanding how we receive information and guidance. I have expanded my understanding of how our intuition works and therefore our ability to receive information from Soul. Once you understand yourself and can identify your primary ways of receiving guidance, you then have to practice. My belief is that more and more people are clairsentient and claircognizant. Physical people feel through their bodies.",
    "summary_I  Want to Know What LOVE Is….txt": "Love isn’t about what we GET, it’s about whatWe GIVE! We have been programmed to believe that Love is what we Get. Part of the problem is that we think Love is about Us. But Love doesn't have to do with what we want or need. It isn't about fixing or BEingwhat we want another person to BE.",
    "summary_Holidays and Gratitude!.txt": "Despite two mega doses of antibiotics and some natural health supplements to super charge my immune system perhaps what changed is that we are in the end of the nine year cycle. I believe that cycle is what has been holding me in a certain pattern that is finally ready to be released. This Blessing forwards a prayer into the world that is sacred to those we love as well as to the planet.",
    "summary_Express Your Authenticity, Express Your Soul Essence.txt": "If we can look deep enough in our hearts, what we all seek is to be loved and accepted for who we are. Relationships have the ability to show us our shadows, and we can then choose to accept them. When we are in the present, we can be more authentic; this honors our Self and allows for healing to begin. It is also about learning to choose to respond to situations from your authentic self.",
    "summary_Creating the Magic of the Age of Aquarius.txt": " Pluto moving into the sign of Aquarius this month, March 23, 2023 for a few months until it comes back in Jan 21, 2024 for the next 20 years. I see this as the beginning of the transition to the Age of Aquarian. \"What is outside of us is a reflection of what is within us,\" says the group. \"The connections we develop and the relationships that are important, come from a Heart that is Open\"",
    "summary_Will you be in the Magic of the Moment this Holiday Season.txt": "When you do something, don't do it because you have to, but because you honestly, with an open Heart, want to. If you are asked to do something that triggers you, shift into a different space of unconditional giving. Find a way to stay true to who you are without being triggered. Through understanding yourself, learning what your needs are and how to meet them, you will discover the most important piece of the puzzle of YOU.",
    "summary_BEing is a Choice.txt": "How we choose to ‘show up’ to the world is a choice. By choosing Fear we change what happens outside in our world. Maybe believing that only fear motivates change is how some may see it. I don't adhere to that philosophy and I believe that no matter what is happening outside of us we have the choice to choose how we respond.",
    "summary_Purpose ~ Do you know yours.txt": "Every dream and turn we have made in our lives has been to right us on the path of discovery of Who we are. One of the ‘gifts’ in this life is uncovering the magic that lies in our lessons, in our struggles, and in our choices. I invite you to find a way to BE who you are and express your Gifts through your Purpose in life.",
    "summary_Why you might want a House Clearing and Blessing.txt": "In the Beach area of Toronto, there is an underground water flow that when it flows under a home, can increase the intensities of emotions expressed there. In a populous city, our energy gets mixed with that of others, and as we are unconsciously driving around, we may enter into a situation or area where road rage occurred moments – or even hours – before. If our thoughts and emotions can impact water so dramatically, what do you think they do to our bodies?",
    "summary_JOYfully Create Your Powerful Abundance Tools by BEing Clear.txt": "With Venus now direct it is a Great Time to Play JOYfully to Create Abundance. JOY is a powerful way to FEEL and will show the Universe how much it means to you. Gratitude is one of the most powerful tools we can have to create more positivity in our lives. The Higher the Vibration, the more powerful our connection to Source is. Let the NOW Moment fuel you through your Heart and LOVE.",
    "summary_Resolutions and Sabotage.txt": "When we come from a place of Being we are first connecting with the Infinite and Authentic Self within us. This would be where our little self lives and it is just as important to accept who we are from this ‘little’ place. It is in this state of ‘littleness’, caused by the fears previously hidden, that we have the capacity to make changes to our Inner Being.",
    "summary_Happiness – Consciousness of Relationships.txt": "If we knew that everything has a purpose in our lives to help us grow towards ‘love’ then is it possible to allow all of these experiences to be ‘seen’ as opportunities to let go of our fears? We grow when we are ‘relating with others’ and it is only when we canLet go of this need to blame or accept the ‘story’ of our lives as a victim can we truly step out of our patterns of fear.",
    "summary_Expectations and Attachments.txt": "When we have expectations about our attachments to outcomes over which we have no control – and we know it – we tend to be fearful of what we have created or what we are creating. The only way to change this to allow us more opportunity to experience more of those perfect moments is for us to become more aware of ourselves and of what is happening around us. We can choose to do the same thing over and over and hope we have a different outcome (definition of ‘insanity’) or we can choose small shifts that will allow us to let go. What choices do you make?",
    "summary_Validation.txt": "The LOA puts the focus on \"doing\" everything \"right\" in order to create the change we want to see in our outside reality. We continue to watch our outside world for validation that we are “doing” it right and creating what we desire. What I now am beginning to understand is that we have to change our inner feelings to fill us up and allow our inner world to create our outside experience.",
    "summary_Walking Journey – Movement to Health.txt": "Without our Health what good is the rest of the journey? Movement is part of our Growth, it brings us into a state of balance and assists with the natural state our bodies require. Health is maybe not necessary in our Spiritual Growth – because we can even use poor health as something for us to spiritually work with so that we can grow. We take water for granted here in Canada and the US because we have so much fresh water that we forget when we live in cities that we might require more.",
    "summary_Conscious Creation from the Heart.txt": "Our soul doesn’t care about our bills or our bank account, however, it doesn't want us to live in disappointment either. Instead of focusing on money or career, we need to focus on being aligned with what our soul work is. We see everything outside ourselves through our ego! When time is lost, it is because we were aligned with our soul.",
    "summary_Become Clear in 2010.txt": "As we settle into the New Year, we can be excited about possibilities! We can imagine the joy and passion that is within us. This is the energy that we want to use to create this new year. My Wish for you this 2010, would be to be in alignment with your Soul’s Desires and to allow Love and Joy to be your guides to creating the life you desire.",
    "summary_What is Love.txt": "As we move into the Month of Love and Valentine’s Day, we usually think about romantic relationships. I find that people don’t want to do the work required to maintain and continue creating the Life Partnership they dream about. The path to the Heart can be very scary, because we have to first uncover all the blocks on that path to an Open Heart. This journey allows us to embrace all the aspects that separated us from our Divine Connection with Self.",
    "summary_Past Lives.txt": "Past Lives: Why are they fleeting memories; why we chose to forget them; is there anything significant to learn by them; or are they just a distraction? I wonder if our past lives assist us to Grow Up towards Love or distract us from living this life because they trigger our fears or possibly overwhelm us. This is all wrapped around our purpose: we are here to make a difference and to grow up towards Love.",
    "summary_Finding Peace.txt": "We all have experiences, challenges, choices and personal stories that we have judged and continue to relive. One of our challenges with BEing in the Flow is our ability to Love and Accept ourselves for who we are. Do not try to deny or sugar coat things – simply make peace with who You are. Send love and compassion to all those parts of your Self now! Can you connect to your Inner Self through your senses?",
    "summary_2020 2.0 Year of Ascension Do-Over.txt": "This New Year, 2022, we have the option of a ‘do over’ – it is 2020 2.0. 2022 is not a year of fear and pain for what has been accomplished over the past 2 years – rather it is ayear of Redemption and an Upgrade. There are some workers who will assist the older generations physically, some who can repair and reconnect us to Source. Divine Contracts are necessary to raise the vibration of LOVE on the Planet.",
    "summary_Consciousness of Happiness.txt": "Happiness doesn't come from outside of us – it is a choice – an inner choice. We can make a choice to BE happy, and it is our choice to make. We are in control of our own happiness. It is up to us to make that choice. When all else fails, we can always offer to others our Love by giving and caring about what and where they are on their journey.",
    "summary_A Heart’s Way ~ Shift from the Head to the Heart.txt": "Dalai Lama: We are predominantly in our heads most of the time, reflecting the past, and projecting into the future. Moving from our heads to our bodies, and ultimately our heart, means we are not “doing” but being. We can then respond to situations and people by being loving (for ourselves or others) instead of reacting unconsciously from fear.",
    "summary_What NEW ways will you BE EnJOYing 2023.txt": "If we can understand that EnJOYing is an active choice, then we can consciously make an effort to BE JOY no matter what is happening in our lives. We are now faced with a decision and choice: do we accept our choices – regardless of whatever the choice is and whether or not it has the impact we want it to have on our bodies and lives? You see, Spiritual Growth isn’t always easy or pain free.",
    "summary_Do You Feel the Holiday  Magic.txt": "When we are truly in the Magic of the Moment we are giving from the heart with no expectations. We often dread the Holidays because we want to change others to BE nicer and to see the problems with our dysfunctional relatives as being outside of ourselves and not able to touch us. We have to nurture this Magic that exists in all of us or else we dull its magnificence. This time of year that magic is strongest and we can touch upon it… remember it.",
    "summary_A Year of Peace & Revelations Powerful Intentions.txt": "This is a Year of Peace and Revelations. Living with ease means that we will have an abundance that will allow for our living to be easy for us. We just have to shift our thoughts from the areas that we are having challenges in to the areas we are Thankful for. One way to overcome any fear is to Shift your Perspective or your wording around whatever it is that challenges you. 2024 will be an Important Year for us all.",
    "summary_Are you Compromising too much.txt": "When is compromising the ‘right’ thing to do and when does it corrode who we are and our Soul’s dreams? I think part of the problem is that we aren’t always conscious of our inner values and belief systems. Sometimes it may be about compromising part of what you need for the greater good of the relationship. The other problem is when are we just feeding our ego and its needs? Or opening our hearts and just plain giving?",
    "summary_Holiday Relationships.txt": "The holiday season is about Giving, not getting. When we hold our beliefs and fears from the place of a core wound, we react instead of respond. Think of all the beautiful gifts that you have to offer the people in your life and your community. The gift of the Holidays is that the Magic of this time is strong, and we have an opportunity to connect into this beautiful vibration of giving more easily.",
    "summary_Spring – New Beginnings.txt": "I thing that we first should allow the new energies that are building. It is crucial when you get clear about what you want that it is from a place of expansion, growth and love. I want my story to be a series of Love, not fear. This is Fear triggering us to change, to believe that money is what we want. What will the energy of Money create within us? Create a new story.",
    "summary_Are you Communicating with Integrity.txt": "\"I encourage everyone, whether you are in a relationship or not, to consider what your soul desires from a partnership with another\" \"This has become an important decision I have made about how to communicate with integrity\" \"You can shift your reality by taking responsibility for what is in your life and in your heart now and open to the possibilities that you dream of for yourself\"",
    "summary_2021 Angel Message.txt": "A New Year won’t Magically shift us – it is through our Conscious Choice to Choose LOVE that will create the shift we are looking for. Have Faith in the Universe and Source that all is as it is meant to be and that You are being taken care of. After this year of 2020 we deserve to have Faith that 2021 will be Magical and that Love will abound.",
    "summary_I Love.txt": "Osho: Love isn’t about what we can receive. Love is not about our ego’s desire to control and manipulate the object of our affection. Often our love is conditional on the other person changing, being fixed or accepting that we are “right” and then we want to control how the relationship evolves. The above quote from Osho, describes the type of love that I would like to share with you this Love Month of 2013.",
    "summary_Just Breathe!.txt": "2014 has been a challenging year for many people up until this point, with all the retrograde planets, the eclipses and the Grand Cardinal Cross. What I have realized, is that my health has been interfering with my ability to enjoy life. Is the only energy that is interfering with us our own and where is our focus of intention? I can't tell you how important it is to be grounded. This also flows into being aware of all the things that are affecting our energy.",
    "summary_Change means Surrender.txt": "I had to completely surrender my ego’s control over my life. The lesson was in surrendering my control, and letting go of the person I thought I was! I haven’t opened up to this new image, because a new image hasn”t anchored yet. However, I know that all will be changing for me. I’m looking forward to it.",
    "summary_Spring into New Beginnings.txt": "When we work in fear, we work against ourselves and sabotage comes into play. I made a commitment to my health and wellbeing this past week, making 3 decisions to support my Soul’s desire to be healthy. I also know that when I worry about my choice, my motivation comes from a place of fear. If instead, you try to manipulate, control, fix, heal and change something from a state of fear, because it isn't working, then you recreate the very patterns that created the problem in the first place.",
    "summary_What keeps you up at night.txt": "If financial problems keep you awake, it is likely due to projecting fear of the unknown or anxiety about something. Our fears come in many different colors and names, but if you can take it down to one thing, and see the spectrum as love on one side and fear on the other, whatever you name it; it will ultimately be a fear. A great way that I have learned to find solutions is to write it, or think about it prior to going to bed and either allow my dreams or in thein-between hours of the night to come to you.",
    "summary_Letting Go and Being Open.txt": "Surrendering isn’t easy, and staying open while letting go of things you want, is even more challenging. We have biases that restrict and control people we will be friends with, based on a definition of who we are. Maybe our parents taught us to accept only certain people, and we limit who we let into our lives, and our growth, as a result.",
    "summary_Embracing Reverence A New Perspective on Ego.txt": "The problem was that we held onto a ‘fantasy’ of this relationship. We can’t rely on what we see or hear as we have already made a judgement. When we are hurt by a relationship, it is our Ego that hurts. This is my NEW Shift in Perspective and an opportunity to Feel Reverence for others. This freed up my Ego to Let Go of the fantasy and BE.",
    "summary_Healing through Dreams & Synchronicities.txt": "Intuitivesoul.com is hosting a 21 day healing event with Emmanuel Dagher andZiad Hashash. The event is called Healing through Dreams & Synchronicities. In this video, Intuitivesouls.com looks at a series of what could be seen as unrelated events that I will say were synchronistic guidance from my Divine guidance system that happens to work in very unique ways.",
    "summary_What are your Perceptions.txt": "We tend to get very confused around the two, often separated, views in our world. It is that part of us that feels like we must defend ourselves, prove that we are right, or hide our vulnerabilities by reacting as if we are invulnerable. We are human; we need not try to pretend we are anything but. No matter what, it is your perception of what has “happened’ that has created an inner story.",
    "summary_Love IS….txt": "Love is about letting go of all of our fears, beliefs and idiosyncrasies that we often blame ‘others’ for. Love is about taking responsibility for all of who we are so that we can love others as well as ourselves. And lastly, our search for love has a motivation that we need to identify and understand. It may be self-confidence or it may be that we are learning to love ourselves.",
    "summary_What are you Resisting.txt": "When we have resistance to doing anything, it would benefit us to examine what we are resisting and where the belief is interfering with our intentions. Often our resistance is a gift to understanding what areas of our lives we want to transform. We can accept that there is a reason that we are where we are right now, and find a way to be comfortable with where and who you are in this moment.",
    "summary_The Gift of Christmas Magic.txt": "Many of us are stuck because we can’t imagine or dream – or, for that matter, we have forgotten what Magic feels like. Our Greatest Gift is the Power of Imagination. As you expand your Connection and your energy within your Heart, ask to Remember the Magic. We just can be ourselves and soak in that expansive feeling of knowing that all is working out. That is the MAGIC.",
    "summary_Ready to Spring Forward.txt": "I have come to realize that it is the Choices that we make that are the most important. We often want a relationship because we don’t want to be alone; or we want a million dollars because we fear lack. Contemplate your motivation when you are not sure and find a way to be positively influenced through Love instead of Fear. I am ready for the feel of spring to return!",
    "summary_What if….txt": "When we are present and less mentally active we are more able to connect to our hearts, to our soul, and to our purpose. When we are not mentally active, we are able to be more connected to our heart and soul. We are also able to find our purpose and our purpose in the world. We can connect with our purpose when we are less mentallyactive.",
    "summary_The Healing Power of Love.txt": "Love Heals – and this means that regardless of the Healing I had ALREADY done – there is ALWAYS more to heal. The Universe wants you to Heal through your pain and fear. Your being in that sense of Love will attract more of that Love. The Healing Power of that love is what the Universe wants to Gift you with. Sometimes the purpose of Love in our life is to remind us that it exists.",
    "summary_Realities of Creation  New Book.txt": "This book came about as a co-creation between the speakers on the popular Realities of Creation tele-summit. The reader can take a little from each of the contributors and craft the method of conscious creation that best works for them. \"Our reality is changing and this book provides new information to assist you in your own path of consciouscreation,\" says author DeeWallace.",
    "summary_A New Kind of Gentle Kindness.txt": "Are we ready for a world that is changing to a New ‘Kind’ of Gentle and Kindness? It’s so easy to lay blame and get upset that our lives aren’t the same as last year but what we have to understand is that everything that has happened has happened for a reason. To go backwards now would be a detriment to all the good that is going on with the changes that have already occurred with the unexpected arrival of this pandemic situation.",
    "summary_Rediscovering Joy The Magic of the Season Awaits.txt": "When we are stuck in the past or worrying about the future, other people’s energy can sneak into ours without us even being aware of it. People who come into your energy field with their anger, sadness, pain and fears can influence you if you are not aware they are there. Once you have established what feeling is yours and what is anothers then you can focus on Rediscovering JOY and the Magic of the Season.",
    "summary_Soul Purpose.txt": "Clear the blocks to being in our Hearts, where we can listen to our intuition and express our Soul’s Purpose. Intuition is a skill that is built through practice. When you can uncover all the beliefs, fears, thoughts, expectations, anxieties, etc., that protect your heart, you will create space for your heart's and soul's full expression. Our hearts will guide us through the stillness where our souls express who we are.",
    "summary_2011 Choices.txt": "2011 is a year of ease and grace. Make choices from a place of love. Honouring ourselves, of being gentle with ourselves and for the incredible journey we have undertaken in this life. So, find YOUR way to have “ease and grace” in 2011, through making choices that honour ourselves. Let’s make 2011 a year to remember.",
    "summary_BEing Our Truth, Opening our Hearts to the Light Within A New Year’s Reflection for 2025.txt": "We can also BE Open to the Gentle Knowing of what is Truth and what is Sensationalized. It is only through the acceptance of the Life we have created and where we are on our path – that we will learn to Respond instead of coming from a Reactive place. Let us open our hearts to the light within, allowing it to guide our thoughts, words, and actions. I feel the Heart’s gentle guidance from someone else's connection to the Divine.",
    "summary_Present, Grounded and Balanced.txt": "Grounding ourselves and finding balance within the chaos that exists on this planet, and perhaps in our lives, is Key to living a mindful life. Being in a state of balance is about more than our energy; it is about finding a way to harmonize all areas of our lives. To be grounded, first you must be present in your mind and body and from that place of inner balance, connect in with the earth.",
    "summary_The Question of Love.txt": "If we knew from our Soul’s Purpose it is about learning to love unconditionally would we change anything? My ‘Sacred Wound’ is abandonment and although I have learned to stop taking things so personally it is still my Sacred Wound. Love month isn't just about romantic love, friendship or family love, it isn't about the confusion around self-love, itis: Can I love knowing that this person can leave or die?",
    "summary_What Choices do you make at your Trigger Point.txt": "I believe that there is a mirror here for me and I'm exploring this as it isn't just one client and I’m feeling stuck with my clients who are stuck! I have been involved with several shows on ‘The Story of ME’ and it was the subject of my last blog. We understand that this ‘story’ is not a representation of our truth, but really our story is from our perspectives that are due to our experiences.",
    "summary_Experiences don’t create our beliefs… Our beliefs create our experiences!.txt": "My Soul has been guiding me through my beliefs, through my perceptions of my experiences, and through my understanding of who I am at a Soul level. I needed to experience all this abandonment and betrayal for me to come into alignment with my Soul’s guidance. Even my recent discomforts with my health have been to remind me that this journey isn’t to change what happens but to embrace what I have been learning and give it a voice.",
    "summary_Discovering our Gifts.txt": "This year – as it probably should be every year – the theme will be uncovering our ‘true gift’ and we may have many opportunities to rediscover this truth. To fast track this I suggest that you make a list of the areas in your life where you aren’t BEing authentic. These people will be highlighted for you this year so that you can move into your more authentic self.",
    "summary_What’s Your Motivation.txt": "When you want something and you continue to sabotage your efforts, the place you need to look is your motivation. The trouble is that if on some unconscious level we do not want to be here suffering or for whatever reason, our motivation will be to sabotage the efforts of our conscious self. I didn’t have to take my chronic pain to this level or exasperate my condition further, because I realized the choices I was making and began the journey of healing.",
    "summary_Healing is Remembering You Are Whole.txt": "When we get caught up in the Fear – and fear permeates the collective unconscious of this planet so there’s a lot of fear – we then believe we have to change, fix and heal something within ourselves or someone or situation outside ourselves. We can choose to connect to that Infinite BEing within us that is Whole and Knows it is Perfect just as it is. Things will continue to happen in our lives and our choice is to Remember Who we Are.",
    "summary_A Powerful Summer of FUN with Abundance.txt": "To have a FUN Summer of Abundance we need to Play more, Dance more, LOVE more and Imagine more. Confidently receive all the LOVE, Energy AND MONEY that comes to you. We Create by allowing the Energy that flows through us all to connect to the Inner Essence that is within each of Us so that we can receive our Dreams. That is Abundances.",
    "summary_2020 Vision and the Antidotes to Fear and Stress.txt": "We need to be gentle on ourselves so that our story of guilt, shame, anger, and fear doesn’t overwhelm us. I also find that if I can bestillso that I can discern what is happening around me, those things that are distracting me from BEing Present, this somehow gets me thinking about and inside the present moment. And we can find ourselves taking the small steps – even the ones that help us to be fully present – to have more fun.",
    "summary_A Heart’s Way ~ Getting Clear about what we Want.txt": "In these times of uncertainty and confusion, we are often unclear about what we want. We are, on the other hand, usually very clear about whatWe don’t want. In order to find our path to our heart, so we can align with our Soul’s Purpose and hear its gentle guidance, we need to set clearer intentions. Set your intentions to yourself and the Universe of what you really want.",
    "summary_Arrogance and Forgiveness.txt": "When we have a belief that ‘forgiveness’ is necessary for a situation or a person it is because of a judgment of a right and a wrong occurring with this situation or person. I needed to let go of my arrogance. Let go of the judgment and the arrogance behind the need to feel ‘right’ in the midst of ‘perceiving’ to have been ‘wronged’",
    "summary_Ascension Path LOVE is All You Need!.txt": "We can’t fix the Bully or Victim that is outside of us. The only way to do this is for us to be conscious of our fears. These mechanisms will show us where we are, and from this we can decide whether we want to stay here or take the path towards Ascension. When we decide to BE LOVE, or to be Free or Kind … the Universe will create a life full of LOVE, freedom or kindness.",
    "summary_Forgiveness or Acceptance.txt": "We don’t have to like what happened or even like the person who triggered us or possibly even hurt us – but I suggest we grow towards love as we need to be able to accept that the people who – or events that – may have negatively impacted us are the result of people who may have had their own fears and pain. We just have to remember that when someone acts out it isn't personal. This is Acceptance but Acceptance teaches us that that is NOT love.",
    "summary_Did Your Imagination Sparkle this Summer.txt": "I decided not to write about Ken (or Allan for that matter) only because I feel that this movie has a powerful message for Women. ‘Now Feel’ is an example of what we are taught as young girls. Yet for Barbie, who wanted to BE a Real Woman, she was able to Feel and have compassion for the first time. Regardless of what that feeling is, it will help us understand who we are and who we want to BE.",
    "summary_This is Happening FOR Us.txt": "It is time to shift our perspectives of all the changes – and the News that is sensationalized with fear – to shifting our perspective to one of Love, Expansiveness of Spirit and the Stillness. We need to allow ourselves to be guided by Spirit. Spirit is NOT outside us (well technically it is because Spirit is EVERYTHING) but when we focus on Remembering our Power – it needs to come from within us.",
    "summary_What Affects Your Business.txt": "When life happens and we get caught up in it, our fears tend to get triggered and we may not even realize it. Energy of our emotions can create a lot of anxiety both individually and wherever we work. Energy can be a source of stress and anxiety in the workplace and in our personal lives. It can also be an opportunity for us to learn more about how to manage our emotions.",
    "summary_Pursuit of Happiness.txt": "Every day is the Journey – everyday – and the three components of Spiritual Growth, Creative Expression, and JoyFull Living. We need to BE Authentic so if we aren’t feeling particularly Positive we need to examine why and just not pretend to be something we are not. If you want to share a photo, please send it to iReport.com and we'll add it to this article.",
    "summary_What I learned the past 20 months.txt": "The only way the world found a new course to move forward was to forgo our own needs that had become so ingrained within us. As this year comes to an end it is time to Let Go of the fear, hate, and segregation so that we can BE ready for all the Beauty that is coming our way in 2022. This is what I have learned over the past 20 months and as I observe what I've learned I feel positive and at peace knowing that our future will BE joyous.",
    "summary_Participation or Victim.txt": "We say it doesn’t affect us when the rainforest is being demolished halfway around the world. Or am I just fooling myself and still afraid to participate because taking responsibility is too horrible to consider? Because what can just one person do? Do I just accept that I’m a victim? To send Love and Wellness to the planet. Because the alternative is Being responsible for not only our own lives, but that of our planet’s as well.",
    "summary_2019 Year of Claiming.txt": "For most of my life I have not felt ‘claimed’ by my family or felt I belonged. ‘Home’ to me is where the Heart lies and my actual home is where I live and work – so feeling safe in my ‘home’ is a must. We need to unconditionally Love and Accept our Self, our inner and outer environment as well as the community within which we live.",
    "summary_Growing Up Through our Fears.txt": "I was not prepared for 5 days in a castle under his tutelage. We never fully comprehend the impact of when we immerse ourselves in a group of like-minded and like-hearted people while also using meditation to Grow our Consciousness. It was a win-win for me. It will help me focus on my writing – I hope. Could we actually be afraid of how our dreams could change our lives and help us grow?",
    "summary_Love.txt": "We all have experiences of what we don't want in a relationship. This is always a good place to begin. From the good, bad and ugly, we begin to know what we want. We are the ones that layer our hearts with fear and pain. Whenever there is resistance, that means we are shutting our heart down, and are unable to hear our soul’s guidance.",
    "summary_Choosing to Deepen Commitment with Self.txt": "If we choose to deepen our commitment to Self, we are acknowledging that our Soul’s growth is crucial to our lives. Being conscious of our actions means asking our self whether we are trying to be a better person because we want others to like us or because we are in service and are acting out of a place of unconditional love. Choosing love, comes from our Heart and the gentle guidance of our Soul.",
    "summary_A Heart’s Way ~ Uncover how limiting beliefs, habits, and stories hold us back.txt": "Our family and friends are where our earliest patterns develop. They create the beliefs, habits and stories that shape the ways we live our lives. Our stories impact all of our relationships. This can impact our intimate relationships in one situation and later in situations with money or career. We are just distracting our awareness from our uncomfortable emotions by convincing ourselves that someone or some situation is causing this to us. We need to rewrite our story.",
    "summary_These Boots … Again.txt": "Every morning I force myself to get up and begin my warm up and then go for my walk. It is so cathartic for me to walk. The question I have been contemplating is: what is next? I can’t see that I will change my walking pattern any time soon. Let’s LOVE together and Change the World to what our Souls need.",
    "summary_Heart-Conscious Intentions.txt": "This week I came across a teaching that really hit it home as it encouraged me to contemplate what motivates us. What can we do to change a goal or outcome towards our Motivation of Love and Acceptance? Can you re-word or re-express your goals so that the focus is on how you want to feel or BE? What do you think? Share your thoughts with us in the comments below or post a photo of your own to share with the world.",
    "summary_Happy Holidays!.txt": "The Holidays are a wonderful time to explore good will, sharememories, make new ones, express peace, forgiveness, tolerance and Gratitude. Gifts aren’t about accumulating things, rather the Expression of Unconditional Love and Joy! Let’s be generous and share in the Magical energy that exists during this enchanting time with everyone including ourselves!",
    "summary_In Fear We Trust.txt": "Fears, these deeper fears, create disharmony within us. We try to distract ourselves to make our lives bearable and maybe to make it seem like we even have everything within our control. Our Ego needs to feel in control; however, our fears make our Ego feel out of control. We literally don't see or feel our fears because we have created years of mechanisms of coping with our fears.",
    "summary_What I learned in a year and a half of Frozen Shoulders.txt": "I found it difficult to not focus on the pain or weight loss (things clearly outside of me) when I still could feel pain and my weight wasn't dropping as quickly as I wanted. I uncovered incredible stories and decisions I had made in the past that continue to affect me! I knew that my focus on validating my outside world by needing my symptoms to be alleviated was definitely a part of the problem.",
    "summary_Surrender to the Holidays Relive the Magic.txt": "The holidays are often a challenging time for many. Surrendering the fears that depress us may BE the way to overcome our Depression. During the Holiday Season we are more Social. The Holiday Season is a time when it is all about relationships. We can surrender to the Higher Power so that our fears are diminished and we can Transform ourselves to BE Happy. If we Surrender our need to buy the Perfect Gift and find a way to Create a Magical Memory – that will allow for a Joyful and Magical Holiday Season.",
    "summary_2020 – Year of Ascension & Spiritual Growth.txt": "When we set an intention we proclaim what we are dreaming about and what we intend to do for this year and beyond. This year, 2020, this new decade, I choose to set my Intention to continue to Grow Up, to become more conscious of how I’m living my life, to face some of my deepest fears and acknowledge them. I make choices from a place of Love and Acceptance and as a result my choices are aligned with where I see my life going.",
    "summary_The Stories of ME!.txt": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Visit CNN.com/Travel each week for a new gallery of snapshots. We'll feature a new photo each week, with a selection of our favorite shots from around the world. See the gallery below for more photos from across the world, including the U.S., Australia and New Zealand.",
    "summary_From Me to Unconditional Love and Acceptance.txt": "This month I focus on choosing not to be triggered by myself or others this month. By the age of seven we do not have an emotional understanding of our experiences. We experience this event as the same ‘story’ we have created. To evolve towards love we must consciously understand and see when we want to first react and then take charge of our personal view of the situation.",
    "summary_How to Profoundly Impact Your Happiness.txt": "How we feel is often tied to the situation we are in or the people we are with. We don’t realize that we can BE in charge of how we ‘show up’ This is our choice. And our choices can only BE conscious when we’re in the Now Moment. I’m Open to the possibilities that We all can make choices that will help us to BE Happy – irregardless of what is happening around us.",
    "summary_The Rules of the Game.txt": "We get so caught up in our story that we put all of our energy on fixing, manipulating, or trying to control the game in our search for happiness. Once the story is there, we need to fully see our story, where it came from and begin to let it go. After you have mastered and embraced making a choice from a State of Love, we still have more to let go of!",
    "summary_Deepening Commitment with Self.txt": "Why do we sabotage ourselves by refusing to foster a deeper commitment to Self? We all want to have a strong commitment and love with another Being. What if we treated ourselves like we treat our best friends? I believe it all comes down to ‘choices’. We don’t do what we need; instead, we give away our power and energies to others.",
    "summary_Letting GO – Is it a Choice.txt": "I know when my emotions are triggered and I feel uncomfortable. We definitely need to BE more authentic, acknowledging when we are in emotions that are ‘real’ and true is important in BEing authentic. But allowing these fears to rule our lives, to add to our story and create suffering, is a choice. However, offering a way for others to work with ‘letting go’ is not as easy as I would like.",
    "summary_Love is an Action and Unconditional.txt": "Love is a given and an action. As long as you DO what I want of you, I will love you. Pluto stepping into Aquarius and the Beginning of the Age of Aquarius, we may BEgin to see a shift from the old paradigm of fear and lack consciousness and move into the fifth dimension of LOVE. It is Your choice how or to whom we Gift our LOVE to… but I encourage you by saying “Let’s GIVE LOVE to all!”",
    "summary_BEing vs Doing.txt": "Being isn’t something that will make us happy; being comes from an authentic state that is inside us. Often we are trapped in a state where we can't do anything about it. We can only do something about it if we are aware of what we are being trapped in. We are not aware of our current state. Sometimes we are stuck in the past or in the future and we will only be able to do something, because we are totally unaware of what state we are in.",
    "summary_Self Love.txt": "The question we should ask ourselves before we do anything is are we responding out of love or reacting from fear? Most often we are reacting from a place of fear. Whether we are the victim or victor, we are separate from God/source because we come to this place through fear. This opens us up to the universal flow which will allow us to express and experience love with others and ourselves.",
    "summary_Making Space.txt": "The past few months seem to be suggesting big changes and new beginnings for many, including myself. Sometimes we push against the very thing we desire by not letting go or making space in our life for what we are desiring. We need to let go of the areas in our lives that are no longer working. Here are some tips for Making Space in 3 of the most common areas of Life.",
    "summary_What is Intuitive Counseling.txt": "Some of my clients want a reading for the purpose of knowing what is coming up. To me intuitive counseling – given by professional intuitive counselors – should be very clear and connected when they provide space for a session. When you can offer this gift people can see for themselves what they may want to change to assist them to evolve towards love. The value of working with professionals who have worked on. themselves and therefore understand who they really are.",
    "summary_Love at Any Age is Possible.txt": "During this time I didn’t feel like a relationship was needed – I just wanted to share my life with someone. And that was all it was. I was sure I had been in a Soul Contract with someone – turns out that person just reminded me of my Divine Contract. This reinforces to us – and to our children – that it is better to be in a relationship even if it isn't healthy.",
    "summary_Change.txt": "I’ve coined April as “The Month of Change” This is to allow our new beginnings to move us forward. Change is the one constant force in our lives, yet we still fear it and resist it. Sometimes change happens to us, if we don’t take action or miss the signs. I often feel it is easier if we initiate the change than have it forced upon us.",
    "summary_A Year in the Life….txt": "The media that tells us what we should fear also, as a result, controls us and therefore makes us do, say and think as we are afraid that we won’t get the story of how to live through whatever we're afraid of. Consciousness System doesn't care that we may have made a choice that hurts ourself or others – it doesn't judge us for being manipulated by fear – it just means we will continue on until we can Accept our Choices and make choices that are filled with Love.",
    "summary_Understanding Our Choices.txt": "‘Remembering the Light Within’ suggests that these ‘challenges and opportunities’ will guide us to remember we are already whole. We can choose to BE happy regardless of what is happening outside of us. When we want to blame or justify our reason for being unhappy that it is our own ‘stuff’ coming up as a gift for us to heal.",
    "summary_Emotions and Core Fears.txt": "Emmanuel believes that our emotions are just our mind/ego’s way of distracting us from our deeper core fears that our unconscious believes are too painful. We just need to dive in and allow expression of these fears and to acknowledge that our higher aspects of Self knows that these fears are irrational and NOT truth. The released energy will allow us to be fully conscious of the choices we have made.",
    "summary_How will you Master 2018.txt": "Intentions, to me, are about connecting into how we ‘intend’ to feel and come from a state of BEing not doing. It is our fears that will continue to create our addictions to food, sugar, alcohol, smoking, or whatever else we do that we don’t exercise our will over. Our intentions then come from within us and have a sense of Connection to our Inner Self.",
    "summary_Shame on… Me.txt": "When it comes to addictions – food – is the one area we can’t just stop. Emotional eating is something many struggle with – and this is the kind of eating we do when we feel uncomfortable. With comfort eating may come comfort weight gain but that is not actually very comfortable at all. The shame associated with weight or our body image is unbelievable!",
    "summary_The Beauty to BE Love.txt": "The sense of lack of love and the fear of not having what we think is love really has to do with what our Egos want in an attempt to create that ‘image’ of Love that we are searching for. Do we want to continue to hold fear or Let Go, Surrender and choose from within how to BE? We can be in charge of how we shift our reaction of fear to one of LOVE.",
    "summary_Do you know the Power of Your Heart.txt": "The heart rhythm is the most powerful force in the human body. We can change our heart rhythm by changing our breath. To change your breath, change your heart rhythm with your breath. Change your breath by changing your heart rhythms with your heart. To learn more about how to change your heartbeat, visit: www.heartrhythm.org. To find out more about heart rhythm, visit www. HeartRhythm. org.",
    "summary_Motivation.txt": "Our Intention and Motivation often are a result of our fears. This means that if we can find a way to BE happy, kind, loving, compassionate or peaceful while ‘doing’ what is required to change then we are coming from a state of BEing that comes from who we are. And since we are often guided by fear first – can you discover a way of being motivated through Love while acknowledging your fears as well?",
    "summary_Contemplating Love.txt": "This year I have been focusing on the areas I want to fix – before I feel ready to embrace myself and another. My BEing place knows that I no longer want to BE a sugar addict and I am changing this because it is for my Health and Well-BEing. I always say ‘Dream Big and Let the Magic Unfold’ on our Birthdays and this Year My Wish to You is to Never Give Up – it doesn’t matter how old you are or what stage you are at: Love is the Source of Life!",
    "summary_The Infinite Heart Raises Consciousness.txt": "My Heart recognizes that my head and gut brains are limited while my Heart is connected to Source and therefore is Infinite. Source, in this context, is the Divine, God/dess, all that is. and it was a 2 on the scale of 1-10. Both are about Infinite Love and Possibilities… Infinite Heart… I think this all is connected. It can happen … just like when my computer is slow and choppy and I have forgotten to be conscious (or aware) that all that's happening is a Microsoft update!?",
    "summary_Corona Fear.txt": "It is our responsibility to acknowledge the fears that hold us in our patterns. Can we NOT let these fears relate to the ‘stories’ we have within us? Can we remember we aren’t victims of some bully real or imagined and that we can choose how we respond to everything happening around us? I want to take responsibility for whether I am contributing to the fear or radiating Love, Acceptance and Joy.",
    "summary_Transitions Fears from Change to Death.txt": "\"I feel I have overcome some of my deepest sacred wounds in my own trilogy of transitions that have taken place around me over the past year\" \"I believe the way to understand our issues the most is by detaching ourselves from the intensity or the emotional charge of the experience and the way we can do this is by reviewing our experiences,\" he says. \"I have been through some of the most difficult times of my life.\"",
    "summary_ThanksGiving and Fear.txt": "We need to stop believing we are victims. We are not victims, we are survivors. We can be anything we want to be. We have to let go of the pain – the fear – of being the victim. It’s the only way we can change the world. We expect our Thanksgiving gatherings to be filled with Love, Acceptance, and Happiness despite the fact that our only memories of this occasion are memories of an earlier time.",
    "summary_Change & New Beginnings Love or Fear.txt": "We often want changes in our career, relationships, health or finances. To truly desire change from a place of love, we have to give love. Change from love would come from being in service to others, and having no expectations of what we would “get” as a result of our giving. Why do you want change or a new beginning in your life? How could you approach this from a spot of love versus fear?",
    "summary_Feel The Miracle Of LOVE When Letting Go.txt": "When we react from a place of pain or fear, we begin to fall victim to the world around us. Fears hold us in patterns, trigger our pain, and stop us from BEing all that we can BE. We don’t have to KNOW why we have these fears, that, in itself, can distract us from Letting them Go.",
    "summary_Magic and Grace.txt": "Grace is the Magic of love, compassion, and generosity. It dulls every time we give our fears more power than the “magic” within us and our lives. Magic and grace exist, we just have to hold it within our hearts. To know that beyond the fear that we can get stuck in, there is Divine Consciousness; Grace that breathes through our lives, is our Home.",
    "summary_Chrysalis to Butterfly.txt": "When we are Clear: we are in the NOW moment and open to the guidance of our Inner Being. We change the world by BEing better persons from within. We get to choose whether we want to continue in a world of fear and pain or choose a World that Creates all of our Dreams. I am looking forward to Creating this Magic with you all as we emerge from our Butterfly stage into the world of our tomorrows – filled with happiness.",
    "summary_Failure and Responsibility.txt": "The Fear of Failure is one of our deep core fears that can be responsible for blocking us from Thriving in this life. It is also ingrained in our Ego and in our mind’s attempt to control us, it pushes us to ‘do’ things – to fix, heal or manipulate our environment. It’'s a fear we create where we perceive we aren’t successful or fear our own success as it all culminates in Fear of failure.",
    "summary_Consciousness of Relationships.txt": "We grow when we are ‘relating with others’ and it is only when we can let go of this need to blame or accept the ‘story’ of our lives as a victim can we truly step out of our patterns of fear. Our ‘happiness’ isn’t something that is ‘out’ there, but it is who we are as Divine Beings.",
    "summary_What are your expectations for this Holiday Season Are they to be happy.txt": "We tend to believe our Happiness is outside ourselves, that it is conditional on things outside of us happening perfectly. We are so caught up in our ego about what is perfect that we forget why we are even here. Keeping our focus within ourselves is the only place we can be in charge of how we feel and be able to maintain the feeling of “happiness” within us. That is Happiness!!",
    "summary_Love Matters.txt": "We all have different ways to give and receive Love – through our own Love Language. We are not all the same when it comes to Love. So at this time we should all ponder how Love Matters to us and find ways to express this Love to others – in a way that is authentic to us. And during these times of change and isolation – let’s find ways. to show that Love Matters.",
    "summary_These Boots are made for Walking….txt": "As you increase your walking – some of the discomforts we have with poor digestion will start to shift and we can digest again. Focus on Breathing and moving energy into the pain and discomfort allowed me to be more aware that my body temperature regulation has been surprisingly unhealthy for most of my life. Although, this isn't my typical Blog, I felt it was very important from a learning perspective and Healing our bodies is crucial during a time when Fear is still pushing at us from every angle.",
    "summary_I choose to tune into the reality where….txt": "I have always been against the way the Law of Attraction (LOA) has been described in ‘The Secret’ and by many other people and their books that have arisen as a result of this documentary. I guess the question I want you to ponder is, “what do you truly need to be all that you desire to BE?” Our Heart and Soul do dream and inspire us to Evolve and BEcome.",
    "summary_Fear and Health.txt": "Even with all of these improvements I feel I have a long way to go. Each diet program – including the alkaline diet and Whole 30 – has important messages about diet and how the body responds to dieting. We have all seen the devastation of ‘dis-ease’ that stems from stress and fear. We see it – we know it – and yet we still sabotage ourselves.",
    "summary_Are You Living Your Best Life.txt": "When we allow our fears to make our choices we are still making choices and they are unhappy and disempowered choices. To live our best life means living a balanced life with a positive outlook. We need to be authentic, positive and authentic in all aspects of our lives. We must live a balanced and authentic life with positive outlooks and attitudes. We should be authentic andpositive in every aspect of our life.",
    "summary_When the Law of Attraction Doesn’t Work.txt": "\"The biggest part of my journey has been to understand my own growth and spiritual evolution\" \"We see these people, or mirrors, as separate from ourselves and therefore can’t take 100% responsibility for our growth and what is in our lives\" \"What we really need is to be in the Now moment and focusing on opening our hearts and accepting and loving who we are\"",
    "summary_Can you tell the difference between fear and your gut intuition.txt": "When we aren’t feeling great and are in need of some TLC and our day takes a turn for the worse, this is when it is most important to make sure we have lots of tools at our disposal to turn things around. Learning to trust my intuition and remembering that my gut is a fierce warrior that deserves to be heard regardless of what it is saying is now important.",
    "summary_Transformation.txt": "\"If we want to change our world, we must look at what we are doing in our own lives that contributes to our own destruction,\" she says. \"I have to review all my choices, even the ones that don’t appear to be my choice,\" she adds. \"If I’m committed to thriving then I have to be conscious of everything in my life and all the patterns that appear that show where I'm not in alignment with my soul’s desire to evolve towards Love\"",
    "summary_The Filters of Fear or Love.txt": "Our filters impact how we interpret and view the world. I choose to BE aware of the filters that focus on the fears that I have chosen to work through in this life. When we are conscious of our thoughts, feelings and emotions then we can make a choice – do you want to experience the world through your fears or through Love? It also can change our perceptions – we can clearly understand when we are not in Love and it allows us to make achoice – how would we rather BE?",
    "summary_Gratitude ~ Can you be Grateful for what you don’t want.txt": "Gratitude is primarily an emotional response to our life experiences. If we can be grateful, regardless of whether is something we desire or don't want, then we can truly let it go and lay new pipes. So, what are you grateful for, and can you be grateful not just as a mental exercise, but as a response from the heart and also with your gut whose job it is to protect you?",
    "summary_A Change in Healing by Tracy McBurney.txt": "Some of us have no connection established subconciously or consciously to a belief in a Supreme Being or Primary God. “From the Spark of Pure Love and Light that I am that resides within me, I connect to Source and I give thanks. I thank you for your help” “I ask that all 5 of my bodies,. my wholeness, will have access to direct connection with My Source of Pure. Love and Pure Light”",
    "summary_Do You Forgive.txt": "Our lack of trust, which is accompanied by the feeling of being unsafe, is a deep issue with most of us and it runs to the root of our survival. If we realized just how much harm we do to ourselves by not forgiving and not letting go of our feelings about the situation and/or person – including the Divine – we would never want to withhold forgiveness. Our arrogance in thinking that we are 'right' and others are 'wrong' makes it so difficult to forgive.",
    "summary_Ego Bad or Misunderstood.txt": "Our Ego also is what pushes us to Grow Up because it is our Ego that is triggered when we focus on ‘us’ instead of ‘we’ or ‘you’ So in the midst of this pain there is a positive side effect related to the Ego. Let’s find a way to use our Egos for our own Evolution towards a more Kind, Compassionate and Loving World.",
    "summary_The Masks we Wear!.txt": "We wear masks all the time as we try to be someone other’s will like and appreciate. We experiment with different masks on occasions such as Halloween, or in alcohol-infused situations, or on vacations. We have more courage, and as a result are more authentic, with these masks on. If fear prohibits us from being Who we are, authentically, and courage is what will eventually allow us to be our authentic self, then why are masks used to make us feel safe?",
    "summary_A Meditation Just for YOU.txt": "A Meditation Just for YOU is written by Intuitivesoul. Read the full article at: http://intuitivesouls.com/a-meditation-just-for-you-is-written-by-intuitive-soul-in-the-world-of-people-who-have-been-through-a-difficult-life-experience.",
    "summary_What are your New Year’s Intentions.txt": "This year I am intending to feel love, above the acknowledgement of all that I have accomplished and created within my life. I invite you to focus your intention on what you choose for your inner life. Instead of weight loss and fitness, what inner feeling are you trying to accomplish? Therefore, following my idea of feelings, don’t think of fitness or exercise as a chore, but as a way to feel better.",
    "summary_Magic and Worthiness.txt": "Too often we focus on what we want, need or desire. When we give we are expecting that we will receive something back in return. In order for us to beworthyof receiving gifts, we must be seen as worthy and we do this by giving gifts. The Magical season was somehow unconsciously ingrained in us that our worth was attached to what we received instead of what we gave.",
    "summary_Empowered Choices.txt": "When it comes to relationships, it is never about the other person. We may also perceive events in our lives through our parent’s judgements, hidden triggers from our past lives or our genetic lineage. To be fully “in charge” I had to step into my power, see my reactions for what they were and accept that I had a choice. An empowered choice to not be bullied or taken advantage of.",
    "summary_The Deliciousness of Magic.txt": "Happiness is the ultimate goal that will create the Deliciousness of Magic in our lives. No money will ever lead to happiness, nothing outside ourselves will achieve this goal. Let go of the Hows and the details and allow your focus to be on your true desire and all else will unfold for you in a Magical Way. We will be able to create the Magic we want to create in our own lives and in the lives of those around us.",
    "summary_Motivation and Resistance.txt": "Many sources of the LOA suggest that we can manifest money, cars, houses and relationships and we get caught up in the illusion that this will fill the unhappiness within us. Are we trying to attract/create from a place of fear (eg. if we can come from a soul’s desire to evolve and an acceptance of all that is, not trying to change, do or need)? I believe that our motivation for creating must begin with acceptance of who we are and an understanding from an authentic place.",
    "summary_What Choices make Powerful Moments.txt": "It is a Choice to BE Positive. Are we conscious of our choices? It is easy for us to get caught up in the world around us and feel we have no choice but to react to what the media has interpreted as the problem. If we are always allowing the Media, friends, family and situations to determine how we feel, then we will not ever BE in charge. We can choose a more powerful and positive choice of LOVE.",
    "summary_Christmas Wish.txt": "We must create our Wishes from a place of non-fear and the only changes we can make are within ourselves. If our Wish is something outside of us it is NOT within our control. Can you feel the Love inside when you Imagine that all is right within your world? Then Radiate that Love that you Feel within – outside of you. What a Gift this is to you and to those around you.",
    "summary_Intimacy (Into-me-see).txt": "The more we focus outside, the more unconscious we are of our ‘discomforts’ or how we are feeling. This Divine BEing that is you is always present and you can access it in many ways. If you are like most of us and desire to finally be ‘seen’ and develop Intimacy (into-me-see) with another in your life then take the time to SEE yourself first. This will allow you to BE seen and to haveintimacy with others because you will BE seen within first.",
    "summary_Feelings vs Emotions.txt": "Our emotions are something we have judged as either good or bad. Our feelings are not identified or judged as bad or good, they just are. Can we choose to BE happy, or how we want to respond, even if something is appearing to be happening around us – and just BE? To me these are fascinating questions. If we are open to Feeling and committed to BEing in the Now Moment – then we have an opportunity to allow the moment to unfold.",
    "summary_Keeping your Energy Clear.txt": "It isn't always easy to see how our energy – or the energy of others – is creating more fear in our lives. There are many things we can do before bringing in a professional. Once you determine what is influencing you the determination will assist you in becoming more aware how you are coping and what is affecting your energy. Often we just know what we don’t want but that’s not enough because these are very different things!",
    "summary_Are You Ready for New Beginnings.txt": "This month I listened to a teleclass given by Derek Rydall. He talked about the ‘Great Reversal’ when we realize that everything we need is within us and whatever is missing is what we are not giving. Giving Thanks, as gratitude is always huge part of transforming who we are to who we want to be. It can be done in many ways, financially, tithing, volunteer work, are some examples.",
    "summary_The Dream of Love.txt": "When you think about love, what is it you desire most? Dare to Dream about all the beauty that a relationship can hold. We fear the dream, because we believe it means that we will have to leave the person we are with. A relationship will push you to be the best you you can be. It’s not about the person in your life, but how they make you feel.",
    "summary_Addictions to Wholeness!.txt": "Our addictions are what we create to fill a void. When we feel we aren’t enough, that love is conditional, we believe that this is true. What addiction we create is because we feel this emptiness inside us and our ego becomes formed. We choose addictions and dependencies to fill an emptiness that can't be filled because the emptiness doesn't exist. We are ‘whole’ and there is no piece of our spirit that isn't complete.",
    "summary_How is Love Unfolding in your life.txt": "The goal is to become aware of what is operating in our unconscious that is sabotaging our best efforts to nurture love. If you can release the ideas you have created around yourself and others, you can be free of the drama within your life. That is why it is so important to be open and allow things to unfold, especially when it comes to love. God is always showing us how we can evolve.",
    "summary_2013 Year of Transcending.txt": "2013 is a year where we are to learn to transcend or rise above our lower ego/mind qualities. We can only transcend our lower qualities by first accepting who we are and then rising above this by bridging a connection with our Heart and Soul. Let this year be the year we align with the energies that have gathered to assist us during this time of Ascendance.",
    "summary_2012 Year of Choices.txt": "2012 is the year of much controversy and for some, in the spiritual community, it is the HOPE we have been waiting for. Instead of expanding our business or being open to other opportunities that may allow the income we desire, we can choose what will bring us peace and be the loving thing to do, for ourselves and others. Let’s create a 2012 that expresses love and grace, through the choices we make.",
    "summary_Jasper (Mar 13, 2008-Oct 1, 2016) What I learned!.txt": "The experience that triggered his end came because it was supposed to, a raccoon of all things, something he was well acquainted with. This triggered an animal instinct within him that caused him to feel he wasn't safe in his own home. He always came as my ‘familiar’, coming in at times when he was needed. And my heart knows that this time he will be a she.",
    "summary_A Heart’s Way ~ Present Moment Awareness.txt": "Many of us spend a majority of our lives either reflecting on the past or projecting into the future. To live in the Present moment requires us to be focused on the Here and Now. You have a choice, you can choose to respond from a place of peace, from present moment awareness. You can also focus on your body, how you’re feeling, where you are, and what you're doing.",
    "summary_A Brave New Normal.txt": "Life as we know it – is different now. Or will take this time, since we have indefinite time available to us now, and make changes to our New Normal. We know that fear is what blocks us from Living our Best Life. This time that we are currently in appears to be about nesting, resting, and exploring new opportunities to nurture ‘US’ So we have more choices to BE in our inner worlds.",
    "summary_Resistance blocks JOY.txt": "Jasper was teaching me a very important lesson and I couldn't easily allow him to make his own choices if I was stuck in thinking this was about me being abandoned. I only hope that I have the strength to remember the love he shared with me over these years as a true blessing and not get triggered by my abandonment issues. I knew Jasper was teaching us all a lesson. If you are experiencing anything you don’t want it won't change unless you shift your focus from that to allowing and receiving this flow of Love, Joy and Well-being.",
    "summary_Resistance to Letting Go.txt": "The process of Letting Go is not a new concept as I have read books on a similar theme including “Busting Loose from the Money Game” by Robert Scheinfeld (Wiley 2006) However, when it comes to the Resistance I have been experiencing this month I knew how important a process it was going to be. So, what was I resisting? It seemed that my theme of resistance created a clear path to areas in my life that I haven't been conscious of.",
    "summary_Unconditional Love, Kindness and Compassion.txt": "Love, Kindness and Compassion are a choice. Over these past Two Years I have seen a lot of pain and anger – thoughts and feelings that have led to Hate and Segregation. The needs we have – no matter what they are – sometimes offered by others that evoke in us nice-feeling emotional responses like having people respect us. These needs are NOT about the person you are in a relationship with another. These are what you have to Let Go of in order to Grow Up and give real Love to someone or something."
}